uploads/xml/Travelport-Request-6665ffc1ca326-4384.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <univ:AirCreateReservationReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:common_v51_0="http://www.travelport.com/schema/common_v51_0" xmlns:univ="http://www.travelport.com/schema/universal_v51_0" RetainReservation="Both" TargetBranch="P3763969" TraceId="ea6019faeee38a46698c3c7dc1884838">
      <com:BillingPointOfSaleInfo xmlns:com="http://www.travelport.com/schema/common_v51_0" OriginApplication="UAPI"/>
      <com:BookingTraveler xmlns:com="http://www.travelport.com/schema/common_v51_0" Key="NTcwMDAwODQ2M2VlMGYwNzJiZTcwMC4yNTI1MDk5Nw==" TravelerType="ADT" DOB="1983-10-01">
        <com:BookingTravelerName First="MOHAMED" Last="TAYEA"/>
        <com:PhoneNumber Number="+966548598445"/>
      </com:BookingTraveler>
      <com:FormOfPayment xmlns:com="http://www.travelport.com/schema/common_v51_0" Type="Cash"/>
      <air:AirPricingSolution Key="Ni9yL/bEuDKAY4ul9hAAAA==" TotalPrice="SAR1226.00" BasePrice="EGP7828.00" ApproximateTotalPrice="SAR1226.00" ApproximateBasePrice="SAR618.00" EquivalentBasePrice="SAR618.00" Taxes="SAR608.00" Fees="SAR0.00" ApproximateTaxes="SAR608.00" QuoteDate="2024-06-09">
        <air:AirSegment Key="Ni9yL/bEuDKAP4ul9hAAAA==" Group="0" Carrier="MS" FlightNumber="777" ProviderCode="1G" Origin="CAI" Destination="LHR" DepartureTime="2024-08-07T10:25:00.000+03:00" ArrivalTime="2024-08-07T13:35:00.000+01:00" FlightTime="310" TravelTime="310" Distance="2187" ClassOfService="L" Equipment="773" ChangeOfPlane="false" OptionalServicesIndicator="false" AvailabilitySource="S" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="O and D cache or polled status used with different local status" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked">
          <air:CodeshareInfo OperatingCarrier="MS">Egyptair</air:CodeshareInfo>
          <air:FlightDetails Key="Ni9yL/bEuDKAS4ul9hAAAA==" Origin="CAI" Destination="LHR" DepartureTime="2024-08-07T10:25:00.000+03:00" ArrivalTime="2024-08-07T13:35:00.000+01:00" FlightTime="310" TravelTime="310" Distance="2187"/>
        </air:AirSegment>
        <air:AirPricingInfo Key="Ni9yL/bEuDKAg4ul9hAAAA==" TotalPrice="SAR1226.00" BasePrice="EGP7828.00" ApproximateTotalPrice="SAR1226.00" ApproximateBasePrice="SAR618.00" EquivalentBasePrice="SAR618.00" ApproximateTaxes="SAR608.00" Taxes="SAR608.00" LatestTicketingTime="2024-08-07T23:59:00.000+03:00" PricingMethod="Manual" Refundable="true" IncludesVAT="false" ETicketability="Yes" PlatingCarrier="MS" ProviderCode="1G">
          <air:FareInfo Key="Ni9yL/bEuDKAt4ul9hAAAA==" FareBasis="LRIEGO" PassengerTypeCode="ADT" Origin="CAI" Destination="LHR" EffectiveDate="2024-06-09T22:17:00.000+03:00" DepartureDate="2024-08-07" Amount="SAR618.00" NegotiatedFare="false" NotValidBefore="2024-08-07" NotValidAfter="2024-08-07" TaxAmount="SAR608.00">
            <common_v51_0:Endorsement Value="BAG. BUSINESS 32KG/158CM"/>
            <common_v51_0:Endorsement Value="BAG. ECONOMY 23KG/158CM"/>
            <common_v51_0:Endorsement Value="HAVE A NICE TRIP"/>
            <air:FareRuleKey FareInfoRef="Ni9yL/bEuDKAt4ul9hAAAA==" ProviderCode="1G">6UUVoSldxwh4oG+UbsxDQMbKj3F8T9EyxsqPcXxP0TLGyo9xfE/RMsuWFfXVd1OAly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovAxlpMnOssuF4xWa1uaqI55k3aSkvhp2yberXTBl9Nbz4bpdnY3GP6mTAyGqh8JIaqNJDV2LvcCI/XJNl6Xtm8L73kDvAqzkrToX+hNfHEXoxUV3b2b+cmv9gFHVWNccKgYOs3BFSS2R5r/dK6WK/BsT5jNkAUyAmi4MN1QPqv5Kjd7qrB3nitl4Ya3aiFehFesh3AtWeO9P8y5YV9dV3U4CXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovAzzD4Wdjal2fHna1H5QsLdGaNi6zOfbTtY770mJHGJ8M78oQnvwXv8MmjaEJeJUDbAe0L8pbcWkyVkQk6bhEcuk=</air:FareRuleKey>
            <air:Brand Key="Ni9yL/bEuDKAt4ul9hAAAA==" BrandID="1391979" UpSellBrandID="1391978" Name="ECONOMY BEST OFFER" Carrier="MS" BrandTier="0002">
              <air:Title Type="External" LanguageCode="EN">Economy Best Offer</air:Title>
              <air:Title Type="Short" LanguageCode="EN">BO</air:Title>
              <air:Text Type="MarketingConsumer" LanguageCode="EN">Economy Best Offer</air:Text>
              <air:Text Type="MarketingAgent" LanguageCode="EN">Economy Best Offer</air:Text>
              <air:Text Type="Strapline" LanguageCode="EN">Economy Best Offer</air:Text>
              <air:ImageLocation Type="Agent" ImageWidth="150" ImageHeight="136">https://cdn.travelport.com/egyptair/MS_general_medium_2648.jpg</air:ImageLocation>
              <air:ImageLocation Type="Consumer" ImageWidth="150" ImageHeight="136">https://cdn.travelport.com/egyptair/MS_general_medium_2648.jpg</air:ImageLocation>
              <air:OptionalServices>
                <air:OptionalService Type="Baggage" CreateDate="2024-06-09T19:17:19.279+00:00" Key="Ni9yL/bEuDKAx4ul9hAAAA==" Chargeable="Not offered" Tag="Checked Baggage" DisplayOrder="1">
                  <common_v51_0:ServiceData AirSegmentRef="Ni9yL/bEuDKAP4ul9hAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>Checked Baggage</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
                <air:OptionalService Type="Baggage" CreateDate="2024-06-09T19:17:19.279+00:00" Key="Ni9yL/bEuDKAy4ul9hAAAA==" SecondaryType="CY" Chargeable="Not offered" Tag="Carry On Hand Baggage" DisplayOrder="2">
                  <common_v51_0:ServiceData AirSegmentRef="Ni9yL/bEuDKAP4ul9hAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>Carry On Hand Baggage</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
                <air:OptionalService Type="Branded Fares" CreateDate="2024-06-09T19:17:19.279+00:00" Key="Ni9yL/bEuDKAz4ul9hAAAA==" SecondaryType="RF" Chargeable="Not offered" Tag="Refund" DisplayOrder="4">
                  <common_v51_0:ServiceData AirSegmentRef="Ni9yL/bEuDKAP4ul9hAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>Refund</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
                <air:OptionalService Type="Branded Fares" CreateDate="2024-06-09T19:17:19.279+00:00" Key="Ni9yL/bEuDKA04ul9hAAAA==" SecondaryType="VC" Chargeable="Not offered" Tag="Rebooking" DisplayOrder="3">
                  <common_v51_0:ServiceData AirSegmentRef="Ni9yL/bEuDKAP4ul9hAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>Rebooking</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
                <air:OptionalService Type="PreReservedSeatAssignment" CreateDate="2024-06-09T19:17:19.279+00:00" ServiceSubCode="0B5" Key="Ni9yL/bEuDKA14ul9hAAAA==" Chargeable="Available for a charge" Tag="Seat Assignment" DisplayOrder="5">
                  <common_v51_0:ServiceData AirSegmentRef="Ni9yL/bEuDKAP4ul9hAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>Pre Reserved Seat Assignment</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                  <air:EMD AssociatedItem="Flight"/>
                  <air:Text Type="Strapline" LanguageCode="EN">Pre Reserved Seat Assignment</air:Text>
                  <air:Title Type="External" LanguageCode="EN">Pre Reserved Seat Assignment</air:Title>
                </air:OptionalService>
                <air:OptionalService Type="MealOrBeverage" CreateDate="2024-06-09T19:17:19.279+00:00" Key="Ni9yL/bEuDKA24ul9hAAAA==" Chargeable="Not offered" Tag="Meals and Beverages" DisplayOrder="6">
                  <common_v51_0:ServiceData AirSegmentRef="Ni9yL/bEuDKAP4ul9hAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>Meals and Beverages</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
                <air:OptionalService Type="InFlightEntertainment" CreateDate="2024-06-09T19:17:19.279+00:00" Key="Ni9yL/bEuDKA34ul9hAAAA==" SecondaryType="IT" Chargeable="Not offered" Tag="WiFi" DisplayOrder="7">
                  <common_v51_0:ServiceData AirSegmentRef="Ni9yL/bEuDKAP4ul9hAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>WiFi</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
                <air:OptionalService Type="Lounge" CreateDate="2024-06-09T19:17:19.279+00:00" ServiceSubCode="0BX" Key="Ni9yL/bEuDKA44ul9hAAAA==" Chargeable="Not offered" Tag="Lounge Access" DisplayOrder="10">
                  <common_v51_0:ServiceData AirSegmentRef="Ni9yL/bEuDKAP4ul9hAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>Lounge Access</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                  <air:EMD AssociatedItem="Flight"/>
                  <air:Text Type="Strapline" LanguageCode="EN">Lounge Access</air:Text>
                  <air:Title Type="External" LanguageCode="EN">Lounge Access</air:Title>
                </air:OptionalService>
                <air:OptionalService Type="TravelServices" CreateDate="2024-06-09T19:17:19.279+00:00" ServiceSubCode="03P" Key="Ni9yL/bEuDKA54ul9hAAAA==" SecondaryType="PO" Chargeable="Not offered" Tag="Priority CheckIn" DisplayOrder="14">
                  <common_v51_0:ServiceData AirSegmentRef="Ni9yL/bEuDKAP4ul9hAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>Priority Check In</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                  <air:EMD AssociatedItem="Flight"/>
                  <air:Text Type="Strapline" LanguageCode="EN">Priority Check In</air:Text>
                  <air:Title Type="External" LanguageCode="EN">Priority Check In</air:Title>
                </air:OptionalService>
                <air:OptionalService Type="TravelServices" CreateDate="2024-06-09T19:17:19.279+00:00" ServiceSubCode="0G6" Key="Ni9yL/bEuDKA64ul9hAAAA==" SecondaryType="PR" Chargeable="Not offered" Tag="Priority Boarding" DisplayOrder="17">
                  <common_v51_0:ServiceData AirSegmentRef="Ni9yL/bEuDKAP4ul9hAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>Priority Boarding</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                  <air:EMD AssociatedItem="Flight"/>
                  <air:Text Type="Strapline" LanguageCode="EN">Priority Boarding</air:Text>
                  <air:Title Type="External" LanguageCode="EN">Priority Boarding</air:Title>
                </air:OptionalService>
                <air:OptionalService Type="Upgrades" CreateDate="2024-06-09T19:17:19.279+00:00" ServiceSubCode="0BJ" Key="Ni9yL/bEuDKA74ul9hAAAA==" Chargeable="Available for a charge" Tag="Upgrade" DisplayOrder="9">
                  <common_v51_0:ServiceData AirSegmentRef="Ni9yL/bEuDKAP4ul9hAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>Upgrade</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                  <air:EMD AssociatedItem="Flight"/>
                  <air:Text Type="Strapline" LanguageCode="EN">Upgrade</air:Text>
                  <air:Title Type="External" LanguageCode="EN">Upgrade</air:Title>
                </air:OptionalService>
              </air:OptionalServices>
            </air:Brand>
          </air:FareInfo>
          <air:BookingInfo BookingCode="L" CabinClass="Economy" FareInfoRef="Ni9yL/bEuDKAt4ul9hAAAA==" SegmentRef="Ni9yL/bEuDKAP4ul9hAAAA==" HostTokenRef="Ni9yL/bEuDKAb4ul9hAAAA=="/>
          <air:TaxInfo Category="EG" Amount="SAR12.00" Key="Ni9yL/bEuDKAj4ul9hAAAA=="/>
          <air:TaxInfo Category="EQ" Amount="SAR8.00" Key="Ni9yL/bEuDKAk4ul9hAAAA=="/>
          <air:TaxInfo Category="JK" Amount="SAR8.00" Key="Ni9yL/bEuDKAl4ul9hAAAA=="/>
          <air:TaxInfo Category="O2" Amount="SAR2.00" Key="Ni9yL/bEuDKAm4ul9hAAAA=="/>
          <air:TaxInfo Category="O9" Amount="SAR4.00" Key="Ni9yL/bEuDKAn4ul9hAAAA=="/>
          <air:TaxInfo Category="QH" Amount="SAR94.00" Key="Ni9yL/bEuDKAo4ul9hAAAA=="/>
          <air:TaxInfo Category="S4" Amount="SAR8.00" Key="Ni9yL/bEuDKAp4ul9hAAAA=="/>
          <air:TaxInfo Category="XK" Amount="SAR12.00" Key="Ni9yL/bEuDKAq4ul9hAAAA=="/>
          <air:TaxInfo Category="YQ" Amount="SAR99.00" Key="Ni9yL/bEuDKAr4ul9hAAAA=="/>
          <air:TaxInfo Category="YR" Amount="SAR361.00" Key="Ni9yL/bEuDKAs4ul9hAAAA=="/>
          <air:FareCalc>CAI MS LON 163.92LRIEGO NUC163.92END ROE47.754</air:FareCalc>
          <air:PassengerType Code="ADT" Age="41" BookingTravelerRef="NTcwMDAwODQ2M2VlMGYwNzJiZTcwMC4yNTI1MDk5Nw=="/>
          <air:ChangePenalty PenaltyApplies="Anytime">
            <air:Amount>SAR82.00</air:Amount>
          </air:ChangePenalty>
          <air:CancelPenalty PenaltyApplies="Anytime">
            <air:Amount>SAR94.00</air:Amount>
          </air:CancelPenalty>
          <air:BaggageAllowances>
            <air:BaggageAllowanceInfo TravelerType="ADT" Origin="CAI" Destination="LHR" Carrier="MS">
              <air:URLInfo>
                <air:URL>VIEWTRIP.TRAVELPORT.COM/BAGGAGEPOLICY/MS</air:URL>
              </air:URLInfo>
              <air:TextInfo>
                <air:Text>2P</air:Text>
                <air:Text>BAGGAGE DISCOUNTS MAY APPLY BASED ON FREQUENT FLYER STATUS/ ONLINE CHECKIN/FORM OF PAYMENT/MILITARY/ETC.</air:Text>
              </air:TextInfo>
              <air:BagDetails ApplicableBags="1stChecked" BasePrice="EGP0.00" ApproximateBasePrice="SAR0.00" TotalPrice="EGP0.00" ApproximateTotalPrice="SAR0.00">
                <air:BaggageRestriction>
                  <air:TextInfo>
                    <air:Text>UPTO50LB/23KG</air:Text>
                  </air:TextInfo>
                </air:BaggageRestriction>
              </air:BagDetails>
              <air:BagDetails ApplicableBags="2ndChecked" BasePrice="EGP0.00" ApproximateBasePrice="SAR0.00" TotalPrice="EGP0.00" ApproximateTotalPrice="SAR0.00">
                <air:BaggageRestriction>
                  <air:TextInfo>
                    <air:Text>UPTO50LB/23KG</air:Text>
                  </air:TextInfo>
                </air:BaggageRestriction>
              </air:BagDetails>
            </air:BaggageAllowanceInfo>
            <air:CarryOnAllowanceInfo Origin="CAI" Destination="LHR" Carrier="MS">
              <air:TextInfo>
                <air:Text>1P</air:Text>
              </air:TextInfo>
              <air:CarryOnDetails ApplicableCarryOnBags="1" BasePrice="USD0.00" TotalPrice="USD0.00">
                <air:BaggageRestriction>
                  <air:TextInfo>
                    <air:Text>CARRYON HAND BAGGAGE ALLOWANCE</air:Text>
                  </air:TextInfo>
                </air:BaggageRestriction>
              </air:CarryOnDetails>
            </air:CarryOnAllowanceInfo>
          </air:BaggageAllowances>
        </air:AirPricingInfo>
        <air:FareNote Key="Ni9yL/bEuDKA94ul9hAAAA==">RATE USED IN EQU TOTAL IS BSR 1EGP - 0.07894073SAR</air:FareNote>
        <air:FareNote Key="Ni9yL/bEuDKA+4ul9hAAAA==">LAST DATE TO PURCHASE TICKET: 07AUG24</air:FareNote>
        <air:FareNote Key="Ni9yL/bEuDKA/4ul9hAAAA==">TICKETING AGENCY 36X1</air:FareNote>
        <air:FareNote Key="Ni9yL/bEuDKAA5ul9hAAAA==">DEFAULT PLATING CARRIER MS</air:FareNote>
        <air:FareNote Key="Ni9yL/bEuDKAB5ul9hAAAA==">FARE HAS A PLATING CARRIER RESTRICTION</air:FareNote>
        <air:FareNote Key="Ni9yL/bEuDKAC5ul9hAAAA==">E-TKT REQUIRED</air:FareNote>
        <air:FareNote Key="Ni9yL/bEuDKAD5ul9hAAAA==">TICKETING FEES MAY APPLY</air:FareNote>
        <common_v51_0:HostToken Key="Ni9yL/bEuDKAb4ul9hAAAA==">GFB10101ADT00  01LRIEGO                                010001#GFB200010101NADTV3022EUPO0010001299#GFMCSIP022NEUPO MS ADTLRIEGO</common_v51_0:HostToken>
      </air:AirPricingSolution>
      <com:ActionStatus xmlns:com="http://www.travelport.com/schema/common_v51_0" ProviderCode="1G" Type="ACTIVE" PseudoCityCode="36X1"/>
    </univ:AirCreateReservationReq>
  </soapenv:Body>
</soapenv:Envelope>
